{
    "name": "Adhish Nigam",
    "description": "I have vary good experiance in creation and implementation of user-facing interfaces on websites and mobile applications. It involves utilizing various technologies, such as HTML, CSS, and JavaScript, to build visually appealing and interactive user interfaces that enhance the user experience. A frontend developer's role is to bridge the gap between design and technical implementation, ensuring that the website or mobile app looks and functions as intended. I am skilled in HTML: Hypertext Markup Language (HTML) is the foundation of every web page. A frontend developer should have a strong understanding of HTML to structure and organize content on the web.JavaScript: JavaScript is a powerful programming language that adds interactivity and dynamic behavior to websites and mobile applications. Frontend developers should have a solid understanding of JavaScript concepts and be familiar with frameworks and libraries such as React, Angular. Responsive Design: With the increasing use of mobile devices, it is essential to create websites and mobile apps that adapt and function seamlessly across different screen sizes. Understanding responsive design principles and techniques is crucial for frontend developers.Cross-Browser Compatibility: Frontend developers should be aware of the differences in rendering among various web browsers and ensure that their code works consistently across different browsers and platforms.User Experience (UX): Frontend developers should have a good understanding of UX principles to create interfaces that are intuitive, user-friendly, and optimized for user interactions. They should be able to collaborate with UX designers and implement their designs effectively.Version Control: Proficiency in using version control systems, such as Git, is important for frontend developers to track changes, collaborate with team members, and manage code repositories effectively.Performance Optimization: Optimizing frontend performance is crucial for delivering fast and efficient web and mobile experiences. Knowledge of techniques such as code minification, image optimization, lazy loading, and caching is valuable for frontend developers.Testing and Debugging: Frontend developers should have skills in testing and debugging to ensure the quality and stability of their code. Familiarity with testing frameworks, such as Jest or Mocha, and browser developer tools is beneficial.Continuous Learning: The field of frontend web and mobile development is constantly evolving. Frontend developers should have a passion for continuous learning, staying updated with the latest industry trends, and exploring new technologies and framework ",
    "address": "Kelsterbach, Germany",
    "phone": "+49-15510132051",
    "email": "adhishnigam@gmail.com",
    "role": [
      {
        "user": [
          {
            "id": 2432443,
            "username": "Adhish",
            "role": "Admin",
            "password": "adhish123",
            "description": "Cras mattis consectetur purus sit amet fermentum. Cras justo odio, dapibus ac facilisis in, egestas eget quam. Morbi leo risus, porta ac consectetur ac, vestibulum at eros. Praesent commodo cursus magna, vel scelerisque nisl consectetur et. Cras mattis consectetur purus sit amet fermentum. Cras justo odio, dapibus ac facilisis in, egestas eget quam. Morbi leo risus, porta ac consectetur ac, vestibulum at eros. Praesent commodo cursus magna, vel scelerisque nisl consectetur et. Cras mattis consectetur purus sit amet fermentum. Cras justo odio, dapibus ac facilisis in, egestas eget quam. Morbi leo risus, porta ac consectetur ac, vestibulum at eros. Praesent commodo cursus magna, vel scelerisque nisl consectetur et. Cras mattis consectetur purus sit amet fermentum. Cras justo odio, dapibus ac facilisis in, egestas eget quam. Morbi leo risus, porta ac consectetur ac, vestibulum at eros. Praesent commodo cursus magna, vel scelerisque nisl consectetur et. Cras mattis consectetur purus sit amet fermentum. Cras justo odio, dapibus ac facilisis in, egestas eget quam. Morbi leo risus, porta ac consectetur ac, vestibulum at eros. Praesent commodo cursus magna, vel scelerisque nisl consectetur et. Cras mattis consectetur purus sit amet fermentum. Cras justo odio, dapibus ac facilisis in, egestas eget quam. Morbi leo risus, porta ac consectetur ac, vestibulum at eros. Praesent commodo cursus magna, vel scelerisque nisl consectetur et. Cras mattis consectetur purus sit amet fermentum. Cras justo odio, dapibus ac facilisis in, egestas eget quam. Morbi leo risus, porta ac consectetur ac, vestibulum at eros. Praesent commodo cursus magna, vel scelerisque nisl consectetur et. Cras mattis consectetur purus sit amet fermentum. Cras justo odio, dapibus ac facilisis in, egestas eget quam. Morbi leo risus, porta ac consectetur ac, vestibulum at eros. Praesent commodo cursus magna, vel scelerisque nisl consectetur et. Cras mattis consectetur purus sit amet fermentum. Cras justo odio, dapibus ac facilisis in, egestas eget quam. Morbi leo risus, porta ac consectetur ac, vestibulum at eros. Praesent commodo cursus magna, vel scelerisque nisl consectetur et. Cras mattis consectetur purus sit amet fermentum. Cras justo odio, dapibus ac facilisis in, egestas eget quam. Morbi leo risus, porta ac consectetur ac, vestibulum at eros. Praesent commodo cursus magna, vel scelerisque nisl consectetur et. Cras mattis consectetur purus sit amet fermentum. Cras justo odio, dapibus ac facilisis in, egestas eget quam. Morbi leo risus, porta ac consectetur ac, vestibulum at eros. Praesent commodo cursus magna, vel scelerisque nisl consectetur et. Cras mattis consectetur purus sit amet fermentum. Cras justo odio, dapibus ac facilisis in, egestas eget quam. Morbi leo risus, porta ac consectetur ac, vestibulum at eros. Praesent commodo cursus magna, vel scelerisque nisl consectetur et."
          },
          {
            "id": 2432444,
            "username": "Sonam",
            "role": "Admin",
            "password": "sonam@123"
          },
          {
            "id": 2432445,
            "username": "Vijay",
            "role": "Admin",
            "password": "vijay@123"
          }
        ]
      }
    ],
    "career":[{
      "education":[
          {
              "startYear":"2008",
              "completeYear":"2011",
              "digreeName": "Bachelor Of Computer Application",
              "college": "JNU",
              "type":"full time"
          },
          {
              "startYear":"2008",
              "completeYear":"2011",
              "digreeName": "Masters Of Computer Application",
              "college": "JNU",
              "type":"full time"
          }
  
        ],
      "professionalCareer":[
        {
             "startYear":"June 2011",
             "endYear":"June 2014",
             "name":"Electron Bridge",
             "logo":"",
             "description":"...",
             "responsiblities":"Mobile application(Android) Developer, implement SIP on diler",
             "technelogy":"..."
        },
        {
            "startYear":"Aug 2014",
            "endYear":"June 2022",
            "name":"Tata Consultancy Services",
            "logo":"",
            "description":"...",
            "responsiblities":"Mobile application(Android) Developer, Banking,healthcare,telecom,finince domain",
            "technelogy":"..."
        },[
            {
                "startYear":"Aug 2014",
                "endYear":"Nov 2015",
                "name":"Lloyds Bank Group",
                "logo":"",
                "description":"...",
                "responsiblities":"Mobile application(Android) Developer, Banking app,",
                "technelogy":"Android, java, Mobile apps"   
            },
            {
                "startYear":"Nov 2015",
                "endYear":"May 2016",
                "name":"GE Health Care",
                "logo":"",
                "description":"...",
                "responsiblities":"Mobile application(Android) Developer, Health care app,",
                "technelogy":"Android, java, Mobile apps"   
            },
            {
                "startYear":"July 2016",
                "endYear":"Nov 2018",
                "name":"Celcome Malaysia",
                "logo":"",
                "description":"...",
                "responsiblities":"Mobile hybrid application(Android,iOS) and web Development, Telecome,",
                "technelogy":"Android, java, Mobile apps"   
            },
            {
                "startYear":"Nov 2018",
                "endYear":"June 2022",
                "name":"Generali",
                "logo":"",
                "description":"...",
                "responsiblities":"Mobile application(Android) Developer, Health care app,",
                "technelogy":"Android, java, Mobile apps"   
            }
        ]

        ] 
    }]
  }